namespace Extended.ManageFlash
{
    /*************************************************************************
    * Rutoken                                                                *
    * Copyright (c) 2003-2017, CJSC Aktiv-Soft. All rights reserved.         *
    * Подробная информация:  http://www.rutoken.ru                           *
    *------------------------------------------------------------------------*
    * Пример работы с Рутокен ЭЦП Flash при помощи библиотеки PKCS#11        *
    * на языке C                                                             *
    *------------------------------------------------------------------------*
    * Использование команд управления памятью Рутокен Flash:                 *
    *  - установление соединения с Рутокен в первом доступном слоте;         *
    *  - создание локального PIN-кода Рутокен;                               *
    *  - получение объема флеш-памяти Рутокен;                               *
    *  - создание разделов флеш-памяти Рутокен;                              *
    *  - получение информации о разделах флеш-памяти Рутокен;                *
    *  - изменение атрибутов разделов флеш-памяти Рутокен;                   *
    *  - закрытие соединения с Рутокен.                                      *
    *------------------------------------------------------------------------*
    * Данный пример является самодостаточным.                                *
    *************************************************************************/

    class ManageFlash
    {
        static void Main(string[] args)
        {
        }
    }
}
